Revit 2024 API
BuiltInFailures.JoinElementsFailures.CannotJoinElementsMultiPlaneError Property
 Can't keep elements joined.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId CannotJoinElementsMultiPlaneError { get; }
Visual Basic
Public Shared ReadOnly Property CannotJoinElementsMultiPlaneError As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ CannotJoinElementsMultiPlaneError {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.JoinElementsFailures Class
Autodesk.Revit.DB Namespace